zxc2012/NXP_Creative/控制部分/步步为营_主核/Libraries/startup/DeviceSupport/IAR-ARM/startup_MK60F15.s
        PUBWEAK NFC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)           
NFC_IRQHandler
        B NFC_IRQHandler

        PUBWEAK USBHS_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)   
USBHS_IRQHandler
        B USBHS_IRQHandler

        PUBWEAK Reserved113_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)  
Reserved113_IRQHandler
        B Reserved113_IRQHandler

        PUBWEAK CMP3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)       
CMP3_IRQHandler
        B CMP3_IRQHandler

        PUBWEAK Reserved115_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)       
Reserved115_IRQHandler
        B Reserved115_IRQHandler

        PUBWEAK Reserved116_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)      
Reserved116_IRQHandler
        B Reserved116_IRQHandler

        PUBWEAK FTM3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)          
FTM3_IRQHandler
        B FTM3_IRQHandler

        PUBWEAK ADC2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)         
ADC2_IRQHandler
        B ADC2_IRQHandler

        PUBWEAK ADC3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)   
ADC3_IRQHandler
        B ADC3_IRQHandler
        
        PUBWEAK I2S1_Tx_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)   
I2S1_Tx_IRQHandler
        B I2S1_Tx_IRQHandler
        
        PUBWEAK I2S1_Rx_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)   
I2S1_Rx_IRQHandler
        B I2S1_Rx_IRQHandler

        PUBWEAK DefaultISR
        SECTION .text:CODE:REORDER:NOROOT(1)       
DefaultISR
        B DefaultISR

        END
